import React from "react";
import { Card, Table } from "react-bootstrap";

const Murng = () => {
  const name = [
    "마노",
    "머쉬맘",
    "스텀피",
    "블루 머쉬맘",
    "좀비 머쉬맘",
    "킹 슬라임",
    "다일",
    "킹크랑",
    "파우스트",
    "반레온",
    "메탈 골렘",
    "포장마차",
    "주니어 발록",
    "엘리쟈",
    "크림슨 발록",
    "설산의 미녀",
    "세르프",
    "데우",
    "파파픽시",
    "힐라",
    "디트와 로이 + 네오 휴로이드",
    "키메라 + 호문 스큘러",
    "프랑켄로이드 + 미스릴 뮤테",
    "차우 + 원시멧돼지",
    "에피네아 + 샤이닝 페어리",
    "롬바드 + 킹 블록골렘",
    "타이머 + 틱톡",
    "마스터 스펙터 + 사신 스펙터",
    "마스터 버크 + 듀얼 버크",
    "아카이럼",
    "마뇽 x 2",
    "그리프 x 2",
    "크세르크세스 x 2",
    "파풀라투스 x 2",
    "알리샤르 x 2",
    "스노우맨 x 2",
    "리티 x 2",
    "교도관 아니 x 3",
    "킹 오멘 x 3",
    "매그너스",
    "타르가",
    "스칼리온",
    "요괴선사",
    "데비존",
    "라바나",
    "레비아탄",
    "도도",
    "릴리노흐",
    "라이카",
    "핑크빈",
    "락 스피릿",
    "타란튤로스",
    "드래고니카",
    "드래곤 라이더",
    "호크아이",
    "이카르트",
    "이리나",
    "오즈",
    "미하일",
    "시그너스",
    "피아누스",
    "렉스",
    "카웅",
    "변형된 스텀피",
    "하늘 수호령",
    "게오르크",
    "타락마족 강화늑대기수",
    "아르마",
    "츄릅나무",
    "스우",
    "클리너",
    "악화된 조화의 정령",
    "증발하는 에르다스",
    "아랑",
    "봉선",
    "오공",
    "송달",
    "황룡",
    "적호",
    "무공",
  ];
  const level = [
    100, 102, 104, 106, 108, 110, 113, 115, 118, 120, 120, 123, 125, 128, 130,
    132, 138, 138, 140, 143, 145, 148, 150, 153, 155, 158, 160, 163, 165, 168,
    170, 175, 180, 185, 190, 195, 200, 205, 210, 215, 220, 220, 220, 220, 220,
    230, 230, 230, 230, 230, 240, 240, 240, 240, 240, 245, 245, 245, 245, 245,
    250, 250, 250, 250, 250, 255, 255, 255, 255, 255, 260, 260, 260, 260, 260,
    260, 260, 260, 260, 260,
  ];
  const hp = [
    5200000, 5740800, 6307200, 6930000, 7549200, 12342000, 13923000, 15105000,
    16846000, 100000000, 40824000, 45404550, 48593250, 55350000, 61600500,
    68121000, 78840000, 90011250, 97902000, 1500000000, 130536000, 159138000,
    190350000, 242424000, 405504000, 497040000, 596496000, 706176000, 824256000,
    3000000000, 2108240000, 2526520000, 2976000000, 3464920000, 3986640000,
    4551000000, 5149760000, 6474960000, 7971840000, 8000000000, 42000000000,
    63000000000, 84000000000, 105000000000, 105000000000, 210000000000,
    315000000000, 420000000000, 525000000000, 525000000000, 630000000000,
    735000000000, 840000000000, 945000000000, 1050000000000, 1155000000000,
    1260000000000, 1365000000000, 1470000000000, 1575000000000, 1680000000000,
    1785000000000, 1890000000000, 1911000000000, 1932000000000, 1953000000000,
    1974000000000, 1995000000000, 2016000000000, 2100000000000, 2310000000000,
    2625000000000, 2940000000000, 3255000000000, 3570000000000, 3915000000000,
    4210000000000, 4535000000000, 4857000000000, 5257300000000,
  ];
  return (
    <div>
      <Card>
        <Card.Img variant="top" />
        <Card.Body>
          <Card.Title>무릉</Card.Title>
          <Table striped bordered hover>
            <thead>
              <tr>
                <th>층수</th>
                <th>몬스터</th>
                <th>레벨</th>
                <th>체력</th>
              </tr>
            </thead>
            <tbody>
              {Array.from({ length: name.length }).map((_, index) => (
                <tr>
                  <td key={index}>{index + 1}</td>
                  <td key={index}>{name[index]}</td>
                  <td key={index}>{level[index]}</td>
                  <td key={index}>{hp[index].toLocaleString("ko-KR")}</td>
                </tr>
              ))}
            </tbody>
          </Table>
        </Card.Body>
      </Card>
    </div>
  );
};

export default Murng;
